           03 QMSG.
            05 QMSG-hwnd                        POINTER.
            05 QMSG-msg                         PIC 9(4) COMP-5.
            05 QMSG-mp1                         POINTER.
            05 QMSG-mp2                         POINTER.
            05 QMSG-time                        PIC 9(9) COMP-5.
            05 QMSG-ptl.
             07 QMSG-ptl-x                      PIC S9(9) COMP-5.
             07 QMSG-ptl-y                      PIC S9(9) COMP-5.
