           03 RECTL.
            05 RECTL-xLeft                      PIC S9(9) COMP-5.
            05 RECTL-yBottom                    PIC S9(9) COMP-5.
            05 RECTL-xRight                     PIC S9(9) COMP-5.
            05 RECTL-yTop                       PIC S9(9) COMP-5.
